#include <iostream>

using namespace std;

int main() {
    // 20 * 6 = 120
    // 8 * 15 = 120
    // 즉 각 숫자가 6개씩 모든 곳에 배치되어 있으면
    // 잃어버릴 일이 없다라는 뜻
    // 여기서 5개 컴퓨터가 없어질 때 불행하게 동일한 숫자가 5개가 있더라도 하나가 남기 때문
    printf("1 2 3 4 5 6 7 8\n");
    printf("1 2 3 4 5 6 7 8\n");
    printf("1 2 3 4 5 6 7 8\n");
    printf("1 2 3 4 5 6 7 8\n");
    printf("1 2 3 4 5 6 7 8\n");
    printf("1 2 3 4 5 6 7 8\n");

    printf("9 10 11 12 13 14 15 16\n");
    printf("9 10 11 12 13 14 15 16\n");
    printf("9 10 11 12 13 14 15 16\n");
    printf("9 10 11 12 17 18 19 20\n");
    printf("9 10 11 12 17 18 19 20\n");
    printf("9 10 11 12 17 18 19 20\n");

    printf("13 14 15 16 17 18 19 20\n");
    printf("13 14 15 16 17 18 19 20\n");
    printf("13 14 15 16 17 18 19 20\n");

    return 0;
}